tests/fixtures/stripe/subscription.update.success.json

{
  "id": "sub_EuRj5ucMHxLYCz",
  "object": "subscription",
  "application_fee_percent": null,
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1555603899,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "created": 1555603897,
  "current_period_end": 1558195899,
  "current_period_start": 1555603899,
  "customer": "cus_EuRjdBhqfj5bLW",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_EuRjr8TkXj6vJI",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1555603898,
        "metadata": [],
        "plan": {
          "id": "Plan-2",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 0,
          "billing_scheme": "per_unit",
          "created": 1555603897,
          "currency": "eur",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": [],
          "name": "sapiente",
          "nickname": null,
          "product": "et-delectus-repudiandae-ipsam",
          "statement_descriptor": null,
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "subscription": "sub_EuRj5ucMHxLYCz"
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "\/v1\/subscription_items?subscription=sub_EuRj5ucMHxLYCz"
  },
  "latest_invoice": "in_1EQcprADEVbkzKpDYH6yzaUG",
  "livemode": false,
  "metadata": [],
  "plan": {
    "id": "Plan-2",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 0,
    "billing_scheme": "per_unit",
    "created": 1555603897,
    "currency": "eur",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": [],
    "name": "sapiente",
    "nickname": null,
    "product": "et-delectus-repudiandae-ipsam",
    "statement_descriptor": null,
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1555603899,
  "status": "active",
  "tax_percent": null,
  "trial_end": null,
  "trial_start": null
}